tap "beeftornado/rmtree"
tap "d12frosted/emacs-plus"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions", "https://mirrors.ustc.edu.cn/homebrew-cask-versions.git"
tap "homebrew/core", "https://mirrors.ustc.edu.cn/homebrew-core.git"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "riscv/riscv"
tap "sidneys/homebrew"
tap "sunnyyoung/repo"
tap "tlk/imagemagick-x11"
# Software library to render fonts
brew "freetype"
# GNU database manager
brew "gdbm"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Portable Foreign Function Interface library
brew "libffi"
# Manage compile and link flags for libraries
brew "pkg-config"
# Real-time data compression library
brew "lzo"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Mozilla CA certificate store
brew "ca-certificates"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Download with resuming and segmented downloading
brew "aria2"
# C++ template library for linear algebra
brew "eigen"
# Extremely Fast Compression algorithm
brew "lz4"
# Zstandard is a real-time compression algorithm
brew "zstd"
# GNU compiler collection
brew "gcc"
# Asynchronous event library
brew "libevent"
# High performance message passing library
brew "open-mpi"
# Optimized BLAS library
brew "openblas"
# Routines to solve large scale eigenvalue problems
brew "arpack"
# Highly capable, feature-rich programming language
brew "perl"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Source code beautifier for C, C++, C#, and Java
brew "astyle"
# GNOME accessibility toolkit
brew "atk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Python code formatter
brew "black"
# Collection of portable C++ source libraries
brew "boost"
# Freely available high-quality data compressor
brew "bzip2"
# Blocking, shuffling and loss-less compression library
brew "c-blosc"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Vector graphics library with cross-device output support
brew "cairomm"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Generic library support script
brew "libtool"
# Emulator for x86 and PowerPC
brew "qemu"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Distributed, open source, package manager for C/C++
brew "conan"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Static analysis of C and C++ code
brew "cppcheck"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Real-time software synthesizer based on the SoundFont 2 specs
brew "fluid-synth"
# DOSBox with accurate emulation and wide testing
brew "dosbox-x"
# Charset analyzer and converter
brew "enca"
# Platform built on V8 to build network applications
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# Simple, fast and user-friendly alternative to find
brew "fd"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Cross-platform C++ GUI toolkit
brew "fltk"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Open-source alternative to the OpenGL Utility Toolkit (GLUT) library
brew "freeglut"
# File format designed to store large amounts of data
brew "hdf5"
# Postgres C API library
brew "libpq"
# Image manipulation library
brew "jpeg", link: true
# Adds spatial SQL capabilities to SQLite
brew "libspatialite"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Package for scientific computing with Python
brew "numpy"
# Geospatial Data Abstraction Library
brew "gdal"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# RAD tool for the GTK+ and GNOME environment
brew "glade"
# OpenGL Extension Wrangler Library
brew "glew"
# Multi-platform library for OpenGL applications
brew "glfw"
# Network related modules for glib
brew "glib-networking"
# C++ interface to glib
brew "glibmm"
# C++ mathematics library for graphics software
brew "glm"
# Full-Featured Open-Source Framework for Image Processing
brew "gmic"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Cross-platform application and UI framework
brew "qt@5"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Thin layer of graphic data types
brew "graphene"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# C++ interface to Pango
brew "pangomm"
# C++ interfaces for GTK+ and GNOME
brew "gtkmm4"
# Improved top (interactive process viewer)
brew "htop"
# Network analysis package
brew "igraph"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Interactive computing in Python
brew "ipython"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# CBOR protocol implementation for C and others
brew "libcbor"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# LLVM's OpenMP runtime library
brew "libomp"
# Next-gen compiler infrastructure
brew "llvm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Steel Bank Common Lisp system
brew "sbcl"
# Computer algebra system
brew "maxima"
# Free, open source voxel game engine and game
brew "minetest"
# Run a Kubernetes cluster locally
brew "minikube"
# Platform built on V8 to build network applications
brew "node@16"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Lightweight PDF and XPS viewer
brew "mupdf"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source relational database management system
brew "mysql"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Small build system for use with gyp or CMake
brew "ninja"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Platform built on V8 to build network applications
brew "node@14"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Computer algebra system designed for fast computations in number theory
brew "pari"
# Lightweight pip dependency resolver
brew "pipgrip"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Write once, build anywhere Lua-based build system
brew "premake"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Show ps output as a tree
brew "pstree"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Port to Qt of the Scintilla editing component
brew "qscintilla2"
# Cross-platform application and UI framework
brew "qt"
# Software environment for statistical computing
brew "r"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup-init"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Autoformat shell script source code
brew "shfmt"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# SMART hard drive monitoring
brew "smartmontools"
# State of the art linter for the Go programming language
brew "staticcheck"
# Generate scripting interfaces to C/C++ code
brew "swig"
# System performance benchmark tool
brew "sysbench"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Syntax-aware linter for prose
brew "vale"
# Vi 'workalike' with many additional features
brew "vim"
# Vim script Language Lint
brew "vint"
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Flexible and fast Zsh plugin manager
brew "zinit"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
brew "d12frosted/emacs-plus/emacs-plus@27"
# Play, record, convert, and stream audio and video
brew "homebrew-ffmpeg/ffmpeg/ffmpeg"
brew "hudochenkov/sshpass/sshpass"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# RISC-V toolchain including gcc (with newlib), simulator (spike), and pk
brew "riscv/riscv/riscv-tools"
# Tools and libraries to manipulate images in many formats (X11 support)
brew "tlk/imagemagick-x11/imagemagick"
# Intelligent cloud storage platform
cask "adrive"
# E-books management software
cask "calibre"
# Rule-based custom proxy with GUI based on clash
cask "clashx"
# Teamwork app by Alibaba Group
cask "dingtalk"
# Fork of the DOSBox project
cask "dosbox-x"
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Solve, save and share math problems, graph functions, etc
cask "geogebra"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Free and open-source image editor
cask "gimp"
# Go (golang) IDE
cask "goland"
# Free and open-source media player
cask "iina"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Clipboard manager
cask "maccy"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Simple and elegant markdown editor
cask "mark-text"
# Scanner app for math and science
cask "mathpix-snipping-tool"
# Web browser
cask "microsoft-edge"
# Remote desktop client
cask "microsoft-remote-desktop"
# MIDI player which provides 3D visualization of MIDI data sets
cask "miditrail"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Open-source software for live streaming and screen recording
cask "obs"
# Static source code analysis tool
cask "oclint"
cask "phantomjs"
# Tool for uploading images
cask "picgo"
# Convert HTML to PDF
cask "prince"
# Instant messaging tool
cask "qq"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Data science software focusing on R and Python
cask "rstudio"
# PDF reader and note-taking application
cask "skim"
# Video game digital distribution service
cask "steam"
# Remote desktop control and monitoring tool
cask "sunloginclient"
# Cloud video conferencing
cask "tencent-meeting"
# Remote control software
cask "todesk"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# JavaScript IDE
cask "webstorm"
# Free messaging and calling application
cask "wechat"
# A command line utility to work with WeChatTweak-macOS.
cask "wechattweak-cli"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Network protocol analyzer
cask "wireshark"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Collect, organize, cite, and share research sources
cask "zotero"
mas "CAJ云阅读", id: 1121965993
mas "CHM Viewer Star", id: 650683226
mas "Microsoft To Do", id: 1274495053
mas "Xcode", id: 497799835
